# written for flow package Vivado 
set sdc_version 1.7 

create_clock -name clk -period 10.0 -waveform { 0.0 5.0 } [get_ports {clk}]
set_clock_uncertainty 0.0 [get_clocks {clk}]

create_clock -name virtual_io_clk -period 10.0
## IO TIMING CONSTRAINTS
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {rst}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {data_in_rsc_s_tdone}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {data_in_rsc_tr_write_done}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {data_in_rsc_RREADY}]
set_output_delay -clock [get_clocks {clk}] 1.0 [get_ports {data_in_rsc_RVALID}]
set_output_delay -clock [get_clocks {clk}] 1.0 [get_ports {data_in_rsc_RUSER}]
set_output_delay -clock [get_clocks {clk}] 1.0 [get_ports {data_in_rsc_RLAST}]
set_output_delay -clock [get_clocks {clk}] 1.0 [get_ports {data_in_rsc_RRESP[*]}]
set_output_delay -clock [get_clocks {clk}] 1.0 [get_ports {data_in_rsc_RDATA[*]}]
set_output_delay -clock [get_clocks {clk}] 1.0 [get_ports {data_in_rsc_RID}]
set_output_delay -clock [get_clocks {clk}] 1.0 [get_ports {data_in_rsc_ARREADY}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {data_in_rsc_ARVALID}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {data_in_rsc_ARUSER}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {data_in_rsc_ARREGION[*]}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {data_in_rsc_ARQOS[*]}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {data_in_rsc_ARPROT[*]}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {data_in_rsc_ARCACHE[*]}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {data_in_rsc_ARLOCK}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {data_in_rsc_ARBURST[*]}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {data_in_rsc_ARSIZE[*]}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {data_in_rsc_ARLEN[*]}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {data_in_rsc_ARADDR[*]}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {data_in_rsc_ARID}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {data_in_rsc_BREADY}]
set_output_delay -clock [get_clocks {clk}] 1.0 [get_ports {data_in_rsc_BVALID}]
set_output_delay -clock [get_clocks {clk}] 1.0 [get_ports {data_in_rsc_BUSER}]
set_output_delay -clock [get_clocks {clk}] 1.0 [get_ports {data_in_rsc_BRESP[*]}]
set_output_delay -clock [get_clocks {clk}] 1.0 [get_ports {data_in_rsc_BID}]
set_output_delay -clock [get_clocks {clk}] 1.0 [get_ports {data_in_rsc_WREADY}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {data_in_rsc_WVALID}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {data_in_rsc_WUSER}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {data_in_rsc_WLAST}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {data_in_rsc_WSTRB[*]}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {data_in_rsc_WDATA[*]}]
set_output_delay -clock [get_clocks {clk}] 1.0 [get_ports {data_in_rsc_AWREADY}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {data_in_rsc_AWVALID}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {data_in_rsc_AWUSER}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {data_in_rsc_AWREGION[*]}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {data_in_rsc_AWQOS[*]}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {data_in_rsc_AWPROT[*]}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {data_in_rsc_AWCACHE[*]}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {data_in_rsc_AWLOCK}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {data_in_rsc_AWBURST[*]}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {data_in_rsc_AWSIZE[*]}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {data_in_rsc_AWLEN[*]}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {data_in_rsc_AWADDR[*]}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {data_in_rsc_AWID}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {data_in_rsc_req_vz}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {data_in_rsc_rls_lz}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {hist_out_rsc_s_tdone}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {hist_out_rsc_tr_write_done}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {hist_out_rsc_RREADY}]
set_output_delay -clock [get_clocks {clk}] 1.0 [get_ports {hist_out_rsc_RVALID}]
set_output_delay -clock [get_clocks {clk}] 1.0 [get_ports {hist_out_rsc_RUSER}]
set_output_delay -clock [get_clocks {clk}] 1.0 [get_ports {hist_out_rsc_RLAST}]
set_output_delay -clock [get_clocks {clk}] 1.0 [get_ports {hist_out_rsc_RRESP[*]}]
set_output_delay -clock [get_clocks {clk}] 1.0 [get_ports {hist_out_rsc_RDATA[*]}]
set_output_delay -clock [get_clocks {clk}] 1.0 [get_ports {hist_out_rsc_RID}]
set_output_delay -clock [get_clocks {clk}] 1.0 [get_ports {hist_out_rsc_ARREADY}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {hist_out_rsc_ARVALID}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {hist_out_rsc_ARUSER}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {hist_out_rsc_ARREGION[*]}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {hist_out_rsc_ARQOS[*]}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {hist_out_rsc_ARPROT[*]}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {hist_out_rsc_ARCACHE[*]}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {hist_out_rsc_ARLOCK}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {hist_out_rsc_ARBURST[*]}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {hist_out_rsc_ARSIZE[*]}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {hist_out_rsc_ARLEN[*]}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {hist_out_rsc_ARADDR[*]}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {hist_out_rsc_ARID}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {hist_out_rsc_BREADY}]
set_output_delay -clock [get_clocks {clk}] 1.0 [get_ports {hist_out_rsc_BVALID}]
set_output_delay -clock [get_clocks {clk}] 1.0 [get_ports {hist_out_rsc_BUSER}]
set_output_delay -clock [get_clocks {clk}] 1.0 [get_ports {hist_out_rsc_BRESP[*]}]
set_output_delay -clock [get_clocks {clk}] 1.0 [get_ports {hist_out_rsc_BID}]
set_output_delay -clock [get_clocks {clk}] 1.0 [get_ports {hist_out_rsc_WREADY}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {hist_out_rsc_WVALID}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {hist_out_rsc_WUSER}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {hist_out_rsc_WLAST}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {hist_out_rsc_WSTRB}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {hist_out_rsc_WDATA[*]}]
set_output_delay -clock [get_clocks {clk}] 1.0 [get_ports {hist_out_rsc_AWREADY}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {hist_out_rsc_AWVALID}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {hist_out_rsc_AWUSER}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {hist_out_rsc_AWREGION[*]}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {hist_out_rsc_AWQOS[*]}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {hist_out_rsc_AWPROT[*]}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {hist_out_rsc_AWCACHE[*]}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {hist_out_rsc_AWLOCK}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {hist_out_rsc_AWBURST[*]}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {hist_out_rsc_AWSIZE[*]}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {hist_out_rsc_AWLEN[*]}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {hist_out_rsc_AWADDR[*]}]
set_input_delay -clock [get_clocks {clk}] 1.3 [get_ports {hist_out_rsc_AWID}]
set_input_delay -clock [get_clocks {clk}] 0.0 [get_ports {hist_out_rsc_req_vz}]
set_output_delay -clock [get_clocks {clk}] 0.0 [get_ports {hist_out_rsc_rls_lz}]

